micropython/micropython/ports/stm32/usb.c
int pyb_usb_dev_detect(void) {
    if (usb_device.enabled) {
        return usb_device.hUSBDDevice.id;
    }

    #if MICROPY_HW_USB_FS && MICROPY_HW_USB_HS
    // Try to auto-detect which USB is connected by reading DP/DM pins
    for (int i = 0; i < 2; ++i) {
        mp_hal_pin_obj_t dp = i == 0 ? pyb_pin_USB_DP : pyb_pin_USB_HS_DP;
        mp_hal_pin_obj_t dm = i == 0 ? pyb_pin_USB_DM : pyb_pin_USB_HS_DM;
        mp_hal_pin_config(dp, MP_HAL_PIN_MODE_INPUT, MP_HAL_PIN_PULL_UP, 0);
        mp_hal_pin_config(dm, MP_HAL_PIN_MODE_INPUT, MP_HAL_PIN_PULL_UP, 0);
        int state = mp_hal_pin_read(dp) == 0 && mp_hal_pin_read(dm) == 0;
        mp_hal_pin_config(dp, MP_HAL_PIN_MODE_INPUT, MP_HAL_PIN_PULL_NONE, 0);
        mp_hal_pin_config(dm, MP_HAL_PIN_MODE_INPUT, MP_HAL_PIN_PULL_NONE, 0);
        if (state) {
            // DP and DM pins are actively held low so assume USB is connected
            return i == 0 ? USB_PHY_FS_ID : USB_PHY_HS_ID;
        }
    }
    #endif

    return MICROPY_HW_USB_MAIN_DEV;
}

bool pyb_usb_dev_init(int dev_id, uint16_t vid, uint16_t pid, uint8_t mode, size_t msc_n, const void *msc_unit, USBD_HID_ModeInfoTypeDef *hid_info) {
    usb_device_t *usb_dev = &usb_device;
    if (!usb_dev->enabled) {
        // only init USB once in the device's power-lifetime

        // set up the USBD state
        USBD_HandleTypeDef *usbd = &usb_dev->hUSBDDevice;
        usbd->id = dev_id;
        usbd->dev_state = USBD_STATE_DEFAULT;
        usbd->pDesc = (USBD_DescriptorsTypeDef *)&USBD_Descriptors;
        usbd->pClass = &USBD_CDC_MSC_HID;
        usb_dev->usbd_cdc_msc_hid_state.pdev = usbd;
        for (int i = 0; i < MICROPY_HW_USB_CDC_NUM; ++i) {
            usb_dev->usbd_cdc_msc_hid_state.cdc[i] = &usb_dev->usbd_cdc_itf[i].base;
        }
        #if MICROPY_HW_USB_HID
        usb_dev->usbd_cdc_msc_hid_state.hid = &usb_dev->usbd_hid_itf.base;
        #endif
        usbd->pClassData = &usb_dev->usbd_cdc_msc_hid_state;

        // configure the VID, PID and the USBD mode (interfaces it will expose)
        int cdc_only = (mode & USBD_MODE_IFACE_MASK) == USBD_MODE_CDC;
        USBD_SetVIDPIDRelease(&usb_dev->usbd_cdc_msc_hid_state, vid, pid, 0x0200, cdc_only);
        if (USBD_SelectMode(&usb_dev->usbd_cdc_msc_hid_state, mode, hid_info, MAX_ENDPOINT(dev_id)) != 0) {
            return false;
        }

        #if MICROPY_HW_USB_MSC
        // Configure the MSC interface
        const void *msc_unit_default[1];
        if (msc_n == 0) {
            msc_n = 1;
            msc_unit = msc_unit_default;
            switch (pyb_usb_storage_medium) {
                #if MICROPY_HW_ENABLE_SDCARD
                case PYB_USB_STORAGE_MEDIUM_SDCARD:
                    msc_unit_default[0] = &pyb_sdcard_type;
                    break;
                #endif
                default:
                    msc_unit_default[0] = &pyb_flash_type;
                    break;
            }
        }
        usbd_msc_init_lu(msc_n, msc_unit);
        USBD_MSC_RegisterStorage(&usb_dev->usbd_cdc_msc_hid_state, (USBD_StorageTypeDef *)&usbd_msc_fops);
        #endif

        const uint8_t *fifo_size = usbd_fifo_size_cdc1;
        #if MICROPY_HW_USB_IS_MULTI_OTG
        if ((mode & USBD_MODE_MSC_HID) == USBD_MODE_MSC_HID) {
            fifo_size = usbd_fifo_size_cdc1_msc_hid;
        }
        #endif
        #if MICROPY_HW_USB_CDC_NUM >= 3
        if (mode & USBD_MODE_IFACE_CDC(2)) {
            if ((mode & USBD_MODE_MSC_HID) == USBD_MODE_MSC_HID) {
                fifo_size = usbd_fifo_size_cdc3_msc_hid;
            } else {
                fifo_size = usbd_fifo_size_cdc3;
            }
        } else
        #endif
        #if MICROPY_HW_USB_CDC_NUM >= 2
        if (mode & USBD_MODE_IFACE_CDC(1)) {
            if ((mode & USBD_MODE_MSC_HID) == USBD_MODE_MSC_HID) {
                fifo_size = usbd_fifo_size_cdc2_msc_hid;
            } else {
                fifo_size = usbd_fifo_size_cdc2;
            }
        }
        #endif

        // start the USB device
        USBD_LL_Init(usbd, (mode & USBD_MODE_HIGH_SPEED) != 0, fifo_size);
        USBD_LL_Start(usbd);
        usb_dev->enabled = true;
    }

    return true;
}

void pyb_usb_dev_deinit(void) {
    usb_device_t *usb_dev = &usb_device;
    if (usb_dev->enabled) {
        USBD_Stop(&usb_dev->hUSBDDevice);
        USBD_DeInit(&usb_dev->hUSBDDevice);
        usb_dev->enabled = false;
    }
}

bool usb_vcp_is_enabled(void) {
    return usb_device.enabled;
}

int usb_vcp_recv_byte(uint8_t *c) {
    return usbd_cdc_rx(&usb_device.usbd_cdc_itf[0], c, 1, 0);
}

void usb_vcp_send_strn(const char *str, int len) {
    if (usb_device.enabled) {
        usbd_cdc_tx_always(&usb_device.usbd_cdc_itf[0], (const uint8_t *)str, len);
    }
}

usbd_cdc_itf_t *usb_vcp_get(int idx) {
    return &usb_device.usbd_cdc_itf[idx];
}

#if MICROPY_HW_USB_HID

// return hid interface if hid is configured, NULL otherwise
usbd_hid_itf_t *usbd_hid_get(void) {
    #if defined(USE_HOST_MODE)
    return NULL;
    #else
    uint8_t usb_mode = USBD_GetMode(&usb_device.usbd_cdc_msc_hid_state) & USBD_MODE_IFACE_MASK;
    if (usb_mode == USBD_MODE_HID || usb_mode == USBD_MODE_CDC_HID || usb_mode == USBD_MODE_MSC_HID) {
        return &usb_device.usbd_hid_itf;
    } else {
        return NULL;
    }
    #endif
}

#endif

/******************************************************************************/
// MicroPython bindings for USB

/*
  Philosophy of USB driver and Python API: pyb.usb_mode(...) configures the USB
  on the board.  The USB itself is not an entity, rather the interfaces are, and
  can be accessed by creating objects, such as pyb.USB_VCP() and pyb.USB_HID().

  We have:

    pyb.usb_mode()          # return the current usb mode
    pyb.usb_mode(None)      # disable USB
    pyb.usb_mode('VCP')     # enable with VCP interface
    pyb.usb_mode('VCP+MSC') # enable with VCP and MSC interfaces
    pyb.usb_mode('VCP+HID') # enable with VCP and HID, defaulting to mouse protocol
    pyb.usb_mode('VCP+HID', vid=0xf055, pid=0x9800) # specify VID and PID
    pyb.usb_mode('VCP+HID', hid=pyb.hid_mouse)
    pyb.usb_mode('VCP+HID', hid=pyb.hid_keyboard)
    pyb.usb_mode('VCP+HID', pid=0x1234, hid=(subclass, protocol, max_packet_len, polling_interval, report_desc))

