micropython/micropython/ports/stm32/usb.c
        // need to keep a copy of this so report_desc does not get GC'd
        MP_STATE_PORT(pyb_hid_report_desc) = items[4];
    }
    #endif

    #if USBD_SUPPORT_HS_MODE
    if (args[ARG_high_speed].u_bool) {
        mode |= USBD_MODE_HIGH_SPEED;
    }
    #endif

    // Work out which port/peripheral to use, either user supplied or auto detect
    int dev_id = args[ARG_port].u_int;
    if (dev_id == -1) {
        dev_id = pyb_usb_dev_detect();
    }

    // init the USB device
    if (!pyb_usb_dev_init(dev_id, vid, pid, mode, msc_n, msc_unit, &hid_info)) {
        goto bad_mode;
    }

    #endif

    return mp_const_none;

bad_mode:
    mp_raise_ValueError(MP_ERROR_TEXT("bad USB mode"));
}
MP_DEFINE_CONST_FUN_OBJ_KW(pyb_usb_mode_obj, 0, pyb_usb_mode);

/******************************************************************************/
// MicroPython bindings for USB VCP

/// \moduleref pyb
/// \class USB_VCP - USB virtual comm port
///
/// The USB_VCP class allows creation of an object representing the USB
/// virtual comm port.  It can be used to read and write data over USB to
/// the connected host.

typedef struct _pyb_usb_vcp_obj_t {
    mp_obj_base_t base;
    usbd_cdc_itf_t *cdc_itf;
} pyb_usb_vcp_obj_t;

const pyb_usb_vcp_obj_t pyb_usb_vcp_obj[MICROPY_HW_USB_CDC_NUM] = {
    {{&pyb_usb_vcp_type}, &usb_device.usbd_cdc_itf[0]},
    #if MICROPY_HW_USB_CDC_NUM >= 2
    {{&pyb_usb_vcp_type}, &usb_device.usbd_cdc_itf[1]},
    #endif
    #if MICROPY_HW_USB_CDC_NUM >= 3
    {{&pyb_usb_vcp_type}, &usb_device.usbd_cdc_itf[2]},
    #endif
};

static bool pyb_usb_vcp_irq_scheduled[MICROPY_HW_USB_CDC_NUM];

static void pyb_usb_vcp_init0(void) {
    for (size_t i = 0; i < MICROPY_HW_USB_CDC_NUM; ++i) {
        MP_STATE_PORT(pyb_usb_vcp_irq)[i] = mp_const_none;
        pyb_usb_vcp_irq_scheduled[i] = false;
    }

    // Activate USB_VCP(0) on dupterm slot 1 for the REPL
    MP_STATE_VM(dupterm_objs[1]) = MP_OBJ_FROM_PTR(&pyb_usb_vcp_obj[0]);
    usb_vcp_attach_to_repl(&pyb_usb_vcp_obj[0], true);
}

static mp_obj_t pyb_usb_vcp_irq_run(mp_obj_t self_in) {
    pyb_usb_vcp_obj_t *self = MP_OBJ_TO_PTR(self_in);
    uint8_t idx = self->cdc_itf->cdc_idx;
    mp_obj_t callback = MP_STATE_PORT(pyb_usb_vcp_irq)[idx];
    pyb_usb_vcp_irq_scheduled[idx] = false;
    if (callback != mp_const_none && usbd_cdc_rx_num(self->cdc_itf)) {
        mp_call_function_1(callback, self_in);
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(pyb_usb_vcp_irq_run_obj, pyb_usb_vcp_irq_run);

void usbd_cdc_rx_event_callback(usbd_cdc_itf_t *cdc) {
    uint8_t idx = cdc->cdc_idx;
    mp_obj_t self = MP_OBJ_FROM_PTR(&pyb_usb_vcp_obj[idx]);
    mp_obj_t callback = MP_STATE_PORT(pyb_usb_vcp_irq)[idx];
    if (callback != mp_const_none && !pyb_usb_vcp_irq_scheduled[idx]) {
        pyb_usb_vcp_irq_scheduled[idx] = mp_sched_schedule(MP_OBJ_FROM_PTR(&pyb_usb_vcp_irq_run_obj), self);
    }
}

static void pyb_usb_vcp_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    int id = ((pyb_usb_vcp_obj_t *)MP_OBJ_TO_PTR(self_in))->cdc_itf->cdc_idx;
    mp_printf(print, "USB_VCP(%u)", id);
}

void usb_vcp_attach_to_repl(const pyb_usb_vcp_obj_t *self, bool attached) {
    self->cdc_itf->attached_to_repl = attached;
    if (attached) {
        // Default behavior is non-blocking when attached to repl
        self->cdc_itf->flow &= ~USBD_CDC_FLOWCONTROL_CTS;
    } else {
        self->cdc_itf->flow |= USBD_CDC_FLOWCONTROL_CTS;
    }
}

/// \classmethod \constructor()
/// Create a new USB_VCP object.
static mp_obj_t pyb_usb_vcp_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // check arguments
    mp_arg_check_num(n_args, n_kw, 0, 1, false);

    // TODO raise exception if USB is not configured for VCP

    int id = (n_args == 0) ? 0 : mp_obj_get_int(args[0]);
    if (0 <= id && id < MICROPY_HW_USB_CDC_NUM) {
        return MP_OBJ_FROM_PTR(&pyb_usb_vcp_obj[id]);
    } else {
        mp_raise_ValueError(NULL);
    }
}

// init(*, flow=-1)
static mp_obj_t pyb_usb_vcp_init(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_flow };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_flow, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    pyb_usb_vcp_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // flow control
    if (args[ARG_flow].u_int != -1) {
        self->cdc_itf->flow = args[ARG_flow].u_int;
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(pyb_usb_vcp_init_obj, 1, pyb_usb_vcp_init);

static mp_obj_t pyb_usb_vcp_setinterrupt(mp_obj_t self_in, mp_obj_t int_chr_in) {
    mp_hal_set_interrupt_char(mp_obj_get_int(int_chr_in));
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(pyb_usb_vcp_setinterrupt_obj, pyb_usb_vcp_setinterrupt);

static mp_obj_t pyb_usb_vcp_isconnected(mp_obj_t self_in) {
    pyb_usb_vcp_obj_t *self = MP_OBJ_TO_PTR(self_in);
    return mp_obj_new_bool(usbd_cdc_is_connected(self->cdc_itf));
}
static MP_DEFINE_CONST_FUN_OBJ_1(pyb_usb_vcp_isconnected_obj, pyb_usb_vcp_isconnected);

// deprecated in favour of USB_VCP.isconnected
static mp_obj_t pyb_have_cdc(void) {
    return pyb_usb_vcp_isconnected(MP_OBJ_FROM_PTR(&pyb_usb_vcp_obj[0]));
}
MP_DEFINE_CONST_FUN_OBJ_0(pyb_have_cdc_obj, pyb_have_cdc);

/// \method any()
/// Return `True` if any characters waiting, else `False`.
static mp_obj_t pyb_usb_vcp_any(mp_obj_t self_in) {
    pyb_usb_vcp_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (usbd_cdc_rx_num(self->cdc_itf) > 0) {
        return mp_const_true;
    } else {
        return mp_const_false;
    }
}
static MP_DEFINE_CONST_FUN_OBJ_1(pyb_usb_vcp_any_obj, pyb_usb_vcp_any);

/// \method send(data, *, timeout=5000)
/// Send data over the USB VCP:
///
///   - `data` is the data to send (an integer to send, or a buffer object).
///   - `timeout` is the timeout in milliseconds to wait for the send.
///
/// Return value: number of bytes sent.
static const mp_arg_t pyb_usb_vcp_send_args[] = {
    { MP_QSTR_data,    MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
    { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 5000} },
};
#define PYB_USB_VCP_SEND_NUM_ARGS MP_ARRAY_SIZE(pyb_usb_vcp_send_args)

static mp_obj_t pyb_usb_vcp_send(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    // parse args
    pyb_usb_vcp_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    mp_arg_val_t vals[PYB_USB_VCP_SEND_NUM_ARGS];
    mp_arg_parse_all(n_args - 1, args + 1, kw_args, PYB_USB_VCP_SEND_NUM_ARGS, pyb_usb_vcp_send_args, vals);

